# St7SetSourceAction

Sets the state of the Source option for applicable tools.

long St7SetSourceAction(long uID, long SourceAction)

Input Parameters

uID

Strand7 model file ID.

SourceAction

One of saLeave, saDelete, saCopy or saMove.